knieriem/tinygo-stm32-svd/svd/stm32u545.svd
        <register>
          <name>EXTICR1</name>
          <displayName>EXTICR1</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTIm GPIO port selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>EXTI0</name>
                <enumeratedValue>
                  <name>PA</name>
                  <description>Select PAx as the source input for the EXTIx external interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB</name>
                  <description>Select PBx as the source input for the EXTIx external interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC</name>
                  <description>Select PCx as the source input for the EXTIx external interrupt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD</name>
                  <description>Select PDx as the source input for the EXTIx external interrupt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE</name>
                  <description>Select PEx as the source input for the EXTIx external interrupt</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF</name>
                  <description>Select PFx as the source input for the EXTIx external interrupt</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PG</name>
                  <description>Select PGx as the source input for the EXTIx external interrupt</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PH</name>
                  <description>Select PHx as the source input for the EXTIx external interrupt</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PI</name>
                  <description>Select PIx as the source input for the EXTIx external interrupt</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PJ</name>
                  <description>Select PJx as the source input for the EXTIx external interrupt</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EXTI0">
              <name>EXTI1</name>
              <description>EXTIm+1 GPIO port selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI0">
              <name>EXTI2</name>
              <description>EXTIm+2 GPIO port selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI0">
              <name>EXTI3</name>
              <description>EXTIm+3 GPIO port selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <displayName>EXTICR2</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI4</name>
              <description>EXTIm GPIO port selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI5</name>
              <description>EXTIm+1 GPIO port selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI6</name>
              <description>EXTIm+2 GPIO port selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI7</name>
              <description>EXTIm+3 GPIO port selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <displayName>EXTICR3</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI8</name>
              <description>EXTIm GPIO port selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI9</name>
              <description>EXTIm+1 GPIO port selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI10</name>
              <description>EXTIm+2 GPIO port selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI11</name>
              <description>EXTIm+3 GPIO port selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <displayName>EXTICR4</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI12</name>
              <description>EXTIm GPIO port selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI13</name>
              <description>EXTIm+1 GPIO port selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI14</name>
              <description>EXTIm+2 GPIO port selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="EXTI.EXTICR1.EXTI0">
              <name>EXTI15</name>
              <description>EXTIm+3 GPIO port selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKR</name>
          <displayName>LOCKR</displayName>
          <description>EXTI lock register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Global security and privilege configuration registers (EXTI_SECCFGR and EXTI_PRIVCFGR) lock 
This bit is written once after reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
