knieriem/tinygo-stm32-svd/svd/stm32u545.svd
        <register>
          <name>SVMSR</name>
          <displayName>SVMSR</displayName>
          <description>PWR supply voltage monitoring status register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGS</name>
              <description>Regulator selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>REGS</name>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>LDO selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPS</name>
                  <description>SMPS selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDO</name>
              <description>VDD voltage detector output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PVDO</name>
                <enumeratedValue>
                  <name>EqualOrAboveThreshold</name>
                  <description>VDD is equal or above the PVD threshold selected by PVDLS[2:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDD is below the PVD threshold selected by PVDLS[2:0]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Voltage level ready for currently used VOS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACTVOSRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>VCORE is above or below the current voltage scaling provided by ACTVOS[1:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>VCORE is equal to the current voltage scaling provided by ACTVOS[1:0]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>VOS currently applied to VCORE
This field provides the last VOS value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACTVOS</name>
                <enumeratedValue>
                  <name>Range4</name>
                  <description>Range 4 (lowest power)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range3</name>
                  <description>Range 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range2</name>
                  <description>Range 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range1</name>
                  <description>Range 1 (highest frequency)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDUSBRDY</name>
              <description>VDDUSB ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VDDUSBRDY</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDUSB is below the threshold of the VDDUSB voltage monitor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EqualOrAboveThreshold</name>
                  <description>VDDUSB is equal or above the threshold of the VDDUSB voltage monitor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO2RDY</name>
              <description>VDDIO2 ready</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VDDIO2RDY</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDIO2 is below the threshold of the VDDIO2 voltage monitor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EqualOrAboveThreshold</name>
                  <description>VDDIO2 is equal or above the threshold of the VDDIO2 voltage monitor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDA1RDY</name>
              <description>VDDA ready versus 1.6V voltage monitor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VDDA1RDY</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDA is below the threshold of the VDDA voltage monitor 1 (around 1.6 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EqualOrAboveThreshold</name>
                  <description>VDDA is equal or above the threshold of the VDDA voltage monitor 1 (around 1.6 V)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDA2RDY</name>
              <description>VDDA ready versus 1.8 V voltage monitor</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VDDA2RDY</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDA is below the threshold of the VDDA voltage monitor 2 (around 1.8 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>VDDA is equal or above the threshold of the VDDA voltage monitor 2 (around 1.8 V)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDSR</name>
          <displayName>BDSR</displayName>
          <description>PWR Backup domain status register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBATH</name>
              <description>Backup domain voltage level monitoring versus high threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VBATH</name>
                <enumeratedValue>
                  <name>BelowHigh</name>
                  <description>VBAT &lt; high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AboveHigh</name>
                  <description>VBAT ≥ high threshold</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Temperature level monitoring versus low threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>TEMPL</name>
                <enumeratedValue>
                  <name>AboveLow</name>
                  <description>Temperature &gt; low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowLow</name>
                  <description>Temperature ≤ low threshold</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Temperature level monitoring versus high threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>TEMPH</name>
                <enumeratedValue>
                  <name>BelowHigh</name>
                  <description>Temperature &lt; high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AboveHigh</name>
                  <description>Temperature ≥ high threshold</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUSR</name>
          <displayName>WUSR</displayName>
          <description>PWR wakeup status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUF1</name>
              <description>Wakeup flag 1
This bit is set when a wakeup event is detected on WKUP1 pin. This bit is cleared by writing 1 in the CWUF1 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>WUF1</name>
                <enumeratedValue>
                  <name>NoWakeup</name>
                  <description>No wakeup event occurred on WKUPx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wakeup</name>
                  <description>A wakeup event occurred on WKUPx pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF2</name>
              <description>Wakeup flag 2
This bit is set when a wakeup event is detected on WKUP2 pin. This bit is cleared by writing 1 in the CWUF2 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN2 = 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF3</name>
              <description>Wakeup flag 3
This bit is set when a wakeup event is detected on WKUP3 pin. This bit is cleared by writing 1 in the CWUF3 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN3 = 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF4</name>
              <description>Wakeup flag 4
This bit is set when a wakeup event is detected on WKUP4 pin. This bit is cleared by writing 1 in the CWUF4 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN4 = 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF5</name>
              <description>Wakeup flag 5
This bit is set when a wakeup event is detected on WKUP5 pin. This bit is cleared by writing 1 in the CWUF5 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN5 = 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF6</name>
              <description>Wakeup flag 6
This bit is set when a wakeup event is detected on WKUP6 pin. This bit is cleared by writing 1 in the CWUF6 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN6 = 0.
If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF7</name>
              <description>Wakeup flag 7
This bit is set when a wakeup event is detected on WKUP7 pin. This bit is cleared by writing 1 in the CWUF7 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN7 = 0.
If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
            <field>
              <name>WUF8</name>
              <description>Wakeup flag 8
This bit is set when a wakeup event is detected on WKUP8 pin. This bit is cleared by writing 1 in the CWUF8 bit of PWR_WUSCR when WUSEL ≠ 11, or by hardware when WUPEN8 = 0.
If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>WUSCR</name>
          <displayName>WUSCR</displayName>
          <description>PWR wakeup status clear register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWUF1</name>
              <description>Wakeup flag 1
Writing 1 to this bit clears the WUF1 flag in PWR_WUSR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CWUF1</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear the WUFx flag in PWR_WUSR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWUF2</name>
              <description>Wakeup flag 2
Writing 1 to this bit clears the WUF2 flag in PWR_WUSR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF3</name>
              <description>Wakeup flag 3
Writing 1 to this bit clears the WUF3 flag in PWR_WUSR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF4</name>
              <description>Wakeup flag 4
Writing 1 to this bit clears the WUF4 flag in PWR_WUSR.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF5</name>
              <description>Wakeup flag 5
Writing 1 to this bit clears the WUF5 flag in PWR_WUSR.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF6</name>
              <description>Wakeup flag 6
Writing 1 to this bit clears the WUF6 flag in PWR_WUSR.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF7</name>
              <description>Wakeup flag 7
Writing 1 to this bit clears the WUF7 flag in PWR_WUSR.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
            <field>
              <name>CWUF8</name>
              <description>Wakeup flag 8
Writing 1 to this bit clears the WUF8 flag in PWR_WUSR.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>APCR</name>
          <displayName>APCR</displayName>
          <description>PWR apply pull configuration register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC</name>
              <description>Apply pull-up and pull-down configuration
When this bit is set, the I/O pull-up and pull-down configurations defined in PWR_PUCRx and PWR_PDCRx are applied. When this bit is cleared, PWR_PUCRx and PWR_PDCRx are not applied to the I/Os.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>APC</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>PWR_PUCRx and PWR_PDCRx are not applied to the I/Os</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>I/O pull-up and pull-down configurations defined in PWR_PUCRx and PWR_PDCRx are applied</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
