knieriem/tinygo-stm32-svd/svd/stm32u545.svd
        <register>
          <name>AHB1SMENR</name>
          <displayName>AHB1SMENR</displayName>
          <description>RCC AHB1 peripheral clock enable in Sleep and Stop modes register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPDMA1SMEN</name>
              <description>GPDMA1 clocks enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>GPDMA1SMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORDICSMEN</name>
              <description>CORDIC clocks enable during Sleep and Stop modes
This bit is set and cleared by software during Sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>FMACSMEN</name>
              <description>FMAC clocks enable during Sleep and Stop modes.
This bit is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>MDF1SMEN</name>
              <description>MDF1 clocks enable during Sleep and Stop modes.
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>FLASHSMEN</name>
              <description>FLASH clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>CRCSMEN</name>
              <description>CRC clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>JPEGSMEN</name>
              <description>JPEG clocks enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>TSCSMEN</name>
              <description>TSC clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>RAMCFGSMEN</name>
              <description>RAMCFG clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>DMA2DSMEN</name>
              <description>DMA2D clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>GFXMMUSMEN</name>
              <description>GFXMMU clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>GPU2DSMEN</name>
              <description>GPU2D clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>DCACHE2SMEN</name>
              <description>DCACHE2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>GTZC1SMEN</name>
              <description>GTZC1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>BKPSRAMSMEN</name>
              <description>BKPSRAM clock enable during Sleep and Stop modes
This bit is set and cleared by software</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>ICACHESMEN</name>
              <description>ICACHE clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>DCACHE1SMEN</name>
              <description>DCACHE1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
            <field>
              <name>SRAM1SMEN</name>
              <description>SRAM1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1SMEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2SMENR1</name>
          <displayName>AHB2SMENR1</displayName>
          <description>RCC AHB2 peripheral clock enable in Sleep and	Stop modes register 1</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIOASMEN</name>
              <description>I/O port A clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>GPIOASMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOBSMEN</name>
              <description>I/O port B clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOCSMEN</name>
              <description>I/O port C clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIODSMEN</name>
              <description>I/O port D clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOESMEN</name>
              <description>I/O port E clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOFSMEN</name>
              <description>I/O port F clocks enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOGSMEN</name>
              <description>I/O port G clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOHSMEN</name>
              <description>I/O port H clocks enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOISMEN</name>
              <description>I/O port I clocks enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>GPIOJSMEN</name>
              <description>I/O port J clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>ADC12SMEN</name>
              <description>ADC1 and ADC2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit impacts ADC1 in STM32U535/545/575/585 and ADC1/ADC2 in�STM32U59x/5Ax/5Fx/5Gx.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>DCMI_PSSISMEN</name>
              <description>DCMI and PSSI clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>OTGSMEN</name>
              <description>OTG_FS and OTG_HS clocks enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>OTGHSPHYSMEN</name>
              <description>OTG_HS PHY clock enable during Sleep and Stop modes
This bit is set and cleared by software
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>AESSMEN</name>
              <description>AES clock enable during Sleep and Stop modes
This bit is set and cleared by software
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>HASHSMEN</name>
              <description>HASH clock enable during Sleep and Stop modes
This bit is set and cleared by software</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>RNGSMEN</name>
              <description>RNG clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>PKASMEN</name>
              <description>PKA clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>SAESSMEN</name>
              <description>SAES accelerator clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>OCTOSPIMSMEN</name>
              <description>OCTOSPIM clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>OTFDEC1SMEN</name>
              <description>OTFDEC1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>OTFDEC2SMEN</name>
              <description>OTFDEC2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>SDMMC1SMEN</name>
              <description>SDMMC1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>SDMMC2SMEN</name>
              <description>SDMMC2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>SRAM2SMEN</name>
              <description>SRAM2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
            <field>
              <name>SRAM3SMEN</name>
              <description>SRAM3 clock enable during Sleep and Stop modes
This bit is set and cleared by software. 
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPIOASMEN"/>
            </field>
          </fields>
        </register>
